app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["content", "asdfasdf"], ["created_at", "2018-05-21 10:28:44.094165"], ["updated_at", "2018-05-21 10:28:44.094165"]]
---
    def create
        @post = Post.find(params[:post_id])
        # @comment = @post.comments.new(comment_params)
        # @comment.save
        @comment = @post.comments.create(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        @comment = Post.find(params[:post_id]).comments.find(params[:id])
        @comment.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 6], ["LIMIT", 1]]
---
    def edit
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "123456"], ["updated_at", "2018-05-21 11:57:51.188149"], ["id", 6]]
---
    def update
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])

        @comment.update_attributes(comment_params)